<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Admin Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the admin zone
    |
    | . Root
    | 1. Login
    | 2. Top Nav
    | 3. Navigation
    | 4. User roles
    | 0. Deleting and errors
    |
    */

    //===== Root
    'ok'                    => 'OK',
    'error'                 => 'Грешка',
    'success'               => 'Успех',
    'edit'                  => 'Редакция',
    'delete'                => 'Изтриване',
    'add'                   => 'Добавяне',
    'update'                => 'Обнови',
    'quick_add'             => 'Бързо добавяне',
    'title'                 => 'Заглавие',
    'description'           => 'Описание',
    'content'               => 'Съдържание',
    'create'                => 'Създаване',
    'short_sweet'           => 'Кратко описание',
    'save'                  => 'Запазване',
    'cancel'                => 'Отказ',
    'rotate'                => 'Завъртане',
    'cache_cleared'         => 'Кеша на системата е почистен.',
    'pass'                  => 'Парола',
    'rep_pass'              => 'Повтори паролата',
    'email'                 => 'Мейл',
    'emails'                => 'Мейли',
    'admin'                 => 'Админ',
    'admin_area'            => 'Администраторска зона',
    'developed_by'          => 'Разработено от',
    'key'                   => 'Ключ',
    'custom_url'            => 'Персонализиран URL',
    'from'                  => 'от',
    'keyword'               => 'Ключова дума',
    'attach_images'         => 'Прикачи изображения',
    'choose_files'          => 'Избери файлове',
    'choose_files_nfo'      => 'Файлът трябва да бъде по-малък т 2MB.',
    'choose_files_nfo_2'    => 'Препоръчан размер 1500x1500.',
    'choose_files_nfo_3'    => 'Разрешени разширения: jpg, jpeg, png, gif, svg',
    'upload_one_more'       => 'Качи един или повече файлове',
    'user_access'           => 'Потребителски достъп',
    'user_access_nfo'       => 'Не избирайте никакви роли, ако искате страницата да бъде достъпна за всички (включително и за невписани потребители). Администраторите винаги имат достъп до всички страници.',
    'user_access_only'      => 'Само за потребители с роли:',
    'meta_desc'             => 'Мета описание',
    'meta_desc_nfo'         => 'Използва се при споделяне на страницата в социални мрежи и индексиране в търсачките. Може да бъде празно. Системата попълва сама тага "description", използвайки предоставения текст в полето за съдържание.',
    'none'                  => 'НИЩО',
    'comma_sep'             => 'Разделени със запетая.',
    'see_all'               => 'виж всички',
    'view'                  => 'Виж',
    'pages'                 => 'Страници',
    'date'                  => 'Дата',
    'name'                  => 'име',
    'time'                  => 'време',
    'no_nfo_yet'            => 'Нищо за показване...',
    'version'               => 'Версия',
    'no_keyword'            => 'Моля въведете ключова дума.',
    'upload_images'         => 'Прикачи изображения',

    //===== Color
    'default'               => 'Основен',
    'red'                   => 'Червен',
    'orange'                => 'Оранжев',
    'black'                 => 'Черен',
    'gray'                  => 'Сив',
    'blue'                  => 'Син',
    'green'                 => 'Зелен',

    //===== Login
    'oops'                  => '',
    'err_credentials'       => 'Неуспешно вписване. Моля, проверете данните отново.',
    'err_attempts'          => 'Твърде много опити за влизане! Моля, изчакайте известно време преди да опитате отново.',
    'welcome_msg'           => 'Добре дошли обратно към администраторския панел на :app_name.',
    'remember_me'           => 'Запомни ме',

    //===== Top Nav
    'welcome'               => 'Добре дошли',
    'my_profile'            => 'Моят профил',
    'logout'                => 'Отписване',
    'search'                => 'Търсене',
    'users'                 => 'Потребители',
    'settings'              => 'Настройки',
    'clear_cache'           => 'Изчистване на кеша',
    'xls_export'            => 'Експорт',
    'user_roles'            => 'Роли',

    //===== Navigation
    'dashboard'             => 'Табло',
    'infopages'             => 'Инфо страници',
    'menus'                 => 'Менюта',
    'filemanager'           => 'Файлов мениджър',

    //===== Dashboard
    'registered_users'      => 'Регистрирани потребители',
    'registered_users_nfo'  => 'Общ брой потребители',
    'latest_user'           => 'Последен потребител',
    'latest_user_nfo'       => 'Последно регистриран',
    'login_log'             => 'Вписвания на администраторите',
    'clear_history'         => 'Изтриване на историята',
    'clear_auth_sure'       => 'Сигурни ли сте, че искате да изтриете цялата история?',
    'clear_auth_done'       => 'Историята на вписвания беше изтрита успешно.',
    'timezone_nfo'          => 'Променя се в страницата с настройки.',

    //===== Menus
    'menus'                 => 'Менюта',
    'menu'                  => 'Меню',
    'menu_create_suc'       => 'Менюто бе създадено успешно.',
    'menu_update_suc'       => 'Менюто бе обновено успешно.',
    'menu_items'            => 'Елементи на менюто',

    //===== Menu Items
    'menu_item'             => 'Елемент от меню',
    'menu_item_name_holder' => 'Заглавие на елемента',
    'url'                   => 'URL',
    'or_page'               => 'или линк към страница',
    'new_window'            => 'нов прозорец',
    'icon_code'             => 'Код за икона',
    'store_order'           => 'Кликнете "запазване" за да бъде съхранена подредбата на елементите от менюто.',
    'example'               => 'Пример',
    'url_nfo_1'             => 'Въведете url започващ с "http://" или "https://" за връзка към външен уебсайт.',
    'url_nfo_2'             => 'Въведете името на маршрут за връзка към част от вашия уебсайт.',
    'url_nfo_3'             => 'За уебсайтове с една страница можете да въведете името на секцията (започвайки с „#“), за да превъртите надолу (scroll down) към нея.',
    'url_nfo_4'             => 'Оставете празно ако не искате да създадете линк, а просто да използвате елемента като заглавие на подменю.',
    'url_nfo_5'             => 'Ако искате да направите връзка към информационна страница можете да я изберете от падащото меню. В този случай всеки URL адрес, въведен в полето по-горе, ще бъде игнориран от системата.',
    'menu_create'           => 'Създаване на меню',
    'menu_edit'             => 'Редакция на меню',

    //===== Info Pages
    'infopage'              => 'Инфо страница',
    'page_nfo'              => 'Съдържание на страницата',
    'content'               => 'Съдържание',
    'page_group'            => 'Група',
    'nfo_page_group'        => 'Можете да добавите нови групи (ключове) config/app.php.',
    'page_create_suc'       => 'Информационната страница бе създадена успешно.',
    'page_update_suc'       => 'Информационната страница бе обновена успешно.',
    'page_content_nfo'      => '',
    'page_roles_only'       => 'Достъп имат само вписани потребители с тези роли:',
    'page_roles_all'        => 'Всички потребители имат достъп.',
    'sef_nfo'               => 'Най-малко 3 знака. Валидни символи: 0-9, A-Z, a-z, _, -',
    'page_create'           => 'Създаване на страница',
    'page_edit'             => 'Редакция на страница',

    //===== Articles
    'articles'              => 'Статии',
    'tags'                  => 'Тагове',
    'article_create_suc'    => 'Статията бе създадена успешно.',
    'article_update_suc'    => 'Статията бе обновена успешно.',
    'with_tag'              => 'с таг',
    'article_create'        => 'Създаване на статия',
    'article_edit'          => 'Редакция на статия',

    //===== Users
    'user_create'           => 'Добавяне на потребител',
    'user_edit'             => 'Редакция на потребител',
    'user_create_suc'       => 'Потребителят бе създаден успешно.',
    'user_update_suc'       => 'Потребителят бе обновен успешно.',
    'user_bio'              => 'Няколко думи за потребителя...',
    'user_about'            => 'Относно',
    'user_contact_info'     => 'Информация за контакти',
    'user_info'             => 'Потребителска информация',
    'user_mail'             => 'E-mail адрес',
    'user_name'             => 'Потребителско име',
    'user_company'          => 'Компания / организация',
    'user_org_job'          => 'Компания и позиция',
    'user_job'              => 'Позиция',
    'user_fname'            => 'Първо име',
    'user_lname'            => 'Фамилно име',
    'user_city'             => 'Град',
    'user_country'          => 'Страна',
    'user_role'             => 'Потребителска роля',
    'user_language'         => 'Избран език',


    //===== User roles
    'role'                  => 'Роля',
    'create_role'           => 'Създаване на нова роля',
    'role_edit'             => 'Редакция на роля',
    'role_info'             => 'Информация за ролята',
    'role_root'             => 'Администраторската роля не може да бъде редактирана.',

    //===== File Manager
    'fm_images'             => 'изображения',
    'fm_files'              => 'други файлове',

    //===== Settings
    'main_mail'             => 'Основен e-mail',
    'nfo_main_mail'         => 'Посетителите ще могат да се свързват с Вас на този адрес.',
    'support_mail'          => 'Съпорт e-mail',
    'contact_info'          => 'Информация за контакти',
    'seo_options'           => 'SEO опции',
    'website_name'          => 'Име на уебсайта',
    'website_description'   => 'Описание на уебсайта',
    'nfo_website_desc'      => 'Ще бъде показано само, ако страницата няма собствено описание.',
    'other_settings'        => 'Други настройки',
    'items_per_page'        => 'Брой елементи на страница',
    'date_format'           => 'Формат за датите',
    'nfo_date_format'       => 'Трябва да бъде валиден низ за дата. За повече детайли посетете <a href="https://www.php.net/manual/en/datetime.formats.date.php" target="_blank">https://www.php.net/manual/en/datetime.formats.date.php</a>.',
    'timezone'              => 'Времева зона',
    'header_color'          => 'Цвят на заглавката',

    //===== Export
    'export_what'           => 'Какво искате да експортнете?',
    'select_one'            => 'избор',

    //===== Icons
    'icons_made_by'         => 'Икони от',
    'is_licensed_by'        => 'е лицензиран от',


    //===== Deleting & errors
    'suc_added'             => 'Елементът бе създаден успешно.',
    'suc_updated'           => 'Елементът бе обновен успешно.',
    'suc_deleted'           => 'Елементът бе изтрит успешно.',
    'suc_settings_saved'    => 'Настройките бяха запазени успешно.',
    'err_not_exist'         => 'Елементът не съществува.',
    'err_root_del'          => 'Основният елемент не може да бъде изтрит.',
    'att_deleted'           => 'Прикрепеният файл бе изтрит успешно.',
    'att_del'               => 'Сигурни ли сте, че искате да изтриете прикрепения файл?',
    'err_role'              => 'Изберете роля за потребителя.',
    'err_select_export'     => 'Изберете нещо за експорт.',
    'req_att'               => 'На вашето вниманеие',
    'are_you_sure'          => 'Сигурни ли сте?',
    'these_changes'         => 'Тези промени не могат да бъдат върнати.',
    'err_access_denied'     => 'Забранен достъп.',

    'err_title_required'    => 'Полето за заглавие е задължително - :lang.',
    'err_content_required'  => 'Полето за съдържание е задължително - :lang.',
    'err_title_max'         => 'Заглавието е твърде дълго - :lang.',
    'err_content_max'       => 'Съдържанието е твърде дълго - :lang.',
    'err_title_min'         => 'Заглавието е твърде късо - :lang.',
    'err_must_be_image'     => 'Невалиден файлов формат за изображението.',
    'err_image_upload'      => 'Проблем при качването на изображението. Проверете "upload_max_filesize" в PHP настройките.',
    'err_sef_req'           => 'Полето за персонализиран URL е задължително.',
    'err_sef_min'           => 'Персонализирания URL трябва да е поне 3 символа.',
    'err_sef_max'           => 'Персонализирания URL трябва да е не по-дълъг от 64 символа.',
    'err_sef_spaces'        => 'Не трябва да имате интервали в персонализирания URL адрес.',
    'err_sef_alpha_dash'    => 'Има невалидни символи в персонализирания URL адрес.',

    'err_keyword_required'  => 'Ключовата дума е задължителна.',
    'err_keyword_min'       => 'Ключовата дума трябва да бъде поне 3 символа.',
    'err_keyword_max'       => 'Ключовата дума е прекалено дълга.',
    'err_keyword_spaces'    => 'Ключовата дума не трябва да съдържа интервали.',
    'err_keyword_unique'    => 'Ключовата дума трябва да бъде уникална.',
    'err_title_menu_req'    => 'Заглавието е задължително.',
    'err_title_menu_req_lng'=> 'Заглавието е задължително за всеки един от езиците.',
    
];
