<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Frontend Language Lines
    |--------------------------------------------------------------------------
    |
    | Used for the example controllers and views
    |
    */

    'home_title'                => 'Това е само демо на начална страница',
    'home_content'              => 'hotCoffee идва с няколко контролера и темплейта за да помогнат при разработката на "предната" страна на Вашето приложение. 
                                    Всички те са копирани директно в "app" папката, което означава че могат да бъдат редактирани и дори изтрити за да можете да започнете на чисто.
                                    Всички темплейти се намират в директорията "resources/views/front", а контролерите в "app/Http/Controllers/Front".',
    'article_examples'          => 'ПРИМЕР ЗА СТАТИИ',
    'tags'                      => 'ТАГОВЕ',
    'published'                 => 'Публикувано на',
    'see_more'                  => 'виж още',

];